# Taps
tap 'caskroom/cask'
tap 'homebrew/bundle'
tap 'homebrew/services'

# Install Binaries
brew 'node'
brew 'mas'
brew 'mongodb', restart_service: true
brew 'awscli'

# Apps
cask 'google-chrome'
cask 'google-drive'
cask 'slack'
cask 'vlc'
cask 'iterm2'
cask 'intellij-idea'
cask 'remote-play'
cask 'slate'
cask 'java'
cask 'teamviewer'
cask 'atom'
cask 'grammarly'
cask 'tower'
cask 'firefox'
cask 'robo-3t'
cask 'alfred'
cask 'transmit'
cask 'filezilla'

# Quicklook

# Fonts

# Install Mac App Store apps
mas 'Deckset', id: 847496013
mas 'Xcode', id: 497799835
mas 'Pages', id: 409201541
