# Taps
tap 'caskroom/cask'
tap 'homebrew/bundle'
tap 'homebrew/services'
tap 'fisherman/tap'

# Install Binaries
brew 'node'
brew 'mas'
brew 'mongodb', restart_service: true
brew 'awscli'
brew 'sbt'
brew 'gradle'
brew 'elm'
brew 'fish'
brew 'fisherman'

# Apps
cask 'google-chrome'
cask 'google-drive'
cask 'slack'
cask 'vlc'
cask 'iterm2'
cask 'intellij-idea'
cask 'webstorm'
cask 'remote-play'
cask 'slate'
cask 'java'
cask 'teamviewer'
cask 'atom'
cask 'grammarly'
cask 'tower'
cask 'firefox'
cask 'robo-3t'
cask 'alfred'
cask 'transmit'
cask 'filezilla'
cask 'visual-studio-code'
cask 'flux'

# Quikclook
cask 'qlcolorcode'
cask 'qlstephen'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'qlprettypatch'
cask 'quicklook-csv'
cask 'betterzipql'
cask 'qlimagesize'
cask 'webpquicklook'
cask 'suspicious-package'
cask 'quicklookase'
cask 'qlvideo'

# Fonts

# Install Mac App Store apps
mas 'Deckset', id: 847496013
mas 'Xcode', id: 497799835
mas 'Pages', id: 409201541
